Sunshine2012/STM32_CARD/User/BSP/flash/bsp_spi_flash.h
#ifndef __SPI_FLASH_H
#define __SPI_FLASH_H

#include "stm32f10x.h"
#include <stdio.h>

//#define  sFLASH_ID                    0xEF3015    //AT26XX16
//#define  sFLASH_ID                    0xEF4015    //W25Q16
//#define  sFLASH_ID                    0XEF4018    //W25Q128
//#define  sFLASH_ID                      0XEF4017    //W25Q64
#define  sFLASH_ID                      0x1F0400    //AT26F004

#define SPI_FLASH_PageSize              256
#define SPI_FLASH_PerWritePageSize      256

/*命令定义-开头*******************************/
#define AT26XX_WriteEnable		        0x06
#define AT26XX_WriteDisable		        0x04
#define AT26XX_ReadStatusReg		    0x05
#define AT26XX_WriteStatusReg		    0x01
#define AT26XX_ReadData			        0x03
#define AT26XX_FastReadData		        0x0B
#define AT26XX_FastReadDual		        0x3B
#define AT26XX_ByteProgram		        0x02
#define AT26XX_PageProgram		        0xAF
#define AT26XX_BlockErase			    0xD8
#define AT26XX_SectorErase		        0x20
#define AT26XX_ChipErase			    0xC7
#define AT26XX_PowerDown			    0xB9
#define AT26XX_ReleasePowerDown	        0xAB
#define AT26XX_DeviceID			        0xAB
//#define AT26XX_ManufactDeviceID   	    0x90
#define AT26XX_JedecDeviceID		    0x9F

/* WIP(busy)标志，FLASH内部正在写入 */
#define WIP_Flag                  0x01
#define Dummy_Byte                0xFF
/*命令定义-结尾*******************************/


/*SPI接口定义-开头****************************/
#define      FLASH_SPIx                         SPI1
#define      FLASH_SPI_APBxClock_FUN            RCC_APB2PeriphClockCmd
#define      FLASH_SPI_CLK                      RCC_APB2Periph_SPI1

//CS(NSS)引脚 片选选普通GPIO即可
#define      FLASH_SPI_CS_APBxClock_FUN         RCC_APB2PeriphClockCmd
#define      FLASH_SPI_CS_CLK                   RCC_APB2Periph_GPIOA
#define      FLASH_SPI_CS_PORT                  GPIOA
#define      FLASH_SPI_CS_PIN                   GPIO_Pin_1

//SCK引脚
#define      FLASH_SPI_SCK_APBxClock_FUN        RCC_APB2PeriphClockCmd
#define      FLASH_SPI_SCK_CLK                  RCC_APB2Periph_GPIOA
#define      FLASH_SPI_SCK_PORT                 GPIOA
#define      FLASH_SPI_SCK_PIN                  GPIO_Pin_5
//MISO引脚
#define      FLASH_SPI_MISO_APBxClock_FUN       RCC_APB2PeriphClockCmd
#define      FLASH_SPI_MISO_CLK                 RCC_APB2Periph_GPIOA
#define      FLASH_SPI_MISO_PORT                GPIOA
#define      FLASH_SPI_MISO_PIN                 GPIO_Pin_6
//MOSI引脚
#define      FLASH_SPI_MOSI_APBxClock_FUN       RCC_APB2PeriphClockCmd
#define      FLASH_SPI_MOSI_CLK                 RCC_APB2Periph_GPIOA
#define      FLASH_SPI_MOSI_PORT                GPIOA
#define      FLASH_SPI_MOSI_PIN                 GPIO_Pin_7

#define  		SPI_FLASH_CS_LOW()     						GPIO_ResetBits( FLASH_SPI_CS_PORT, FLASH_SPI_CS_PIN )
#define  		SPI_FLASH_CS_HIGH()    						GPIO_SetBits( FLASH_SPI_CS_PORT, FLASH_SPI_CS_PIN )

/*SPI接口定义-结尾****************************/

/*等待超时时间*/
#define SPIT_FLAG_TIMEOUT         ((uint32_t)0x1000)
#define SPIT_LONG_TIMEOUT         ((uint32_t)(10 * SPIT_FLAG_TIMEOUT))

/*信息输出*/
#define FLASH_DEBUG_ON         1

#define FLASH_INFO(fmt,arg...)           printf("<<-FLASH-INFO->> "fmt"\n",##arg)
#define FLASH_ERROR(fmt,arg...)          printf("<<-FLASH-ERROR->> "fmt"\n",##arg)
#define FLASH_DEBUG(fmt,arg...)          do{\
                                            if(FLASH_DEBUG_ON)\
                                            printf("<<-FLASH-DEBUG->> [%d]"fmt"\n",__LINE__, ##arg);\
                                            }while(0)

void SPI_FLASH_Init(void);
void SPI_FLASH_SectorErase(u32 SectorAddr);
void SPI_FLASH_BulkErase(void);
void SPI_FLASH_PageWrite(u8* pBuffer, u32 WriteAddr, u16 NumByteToWrite);
void SPI_FLASH_BufferWrite(u8* pBuffer, u32 WriteAddr, u16 NumByteToWrite);
void SPI_FLASH_BufferRead(u8* pBuffer, u32 ReadAddr, u16 NumByteToRead);
u32 SPI_FLASH_ReadID(void);
u32 SPI_FLASH_ReadDeviceID(void);
void SPI_FLASH_StartReadSequence(u32 ReadAddr);
void SPI_Flash_PowerDown(void);
void SPI_Flash_WAKEUP(void);


u8 SPI_FLASH_ReadByte(void);
u8 SPI_FLASH_SendByte(u8 byte);
u16 SPI_FLASH_SendHalfWord(u16 HalfWord);
void SPI_FLASH_WriteEnable(void);
void SPI_FLASH_WaitForWriteEnd(void);


#endif /* __SPI_FLASH_H */

